电脑/python/网络编程/http协议学习笔记.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-01-23 六 22:20 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>http学习笔记</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">http学习笔记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. URL结构</a></li>
<li><a href="#orgheadline2">2. http header详解</a></li>
<li><a href="#orgheadline3">3. 名词解释</a></li>
<li><a href="#orgheadline4">4. 参考资料</a></li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">URL结构</h2>
<div class="outline-text-2" id="text-1">
<p>
URL结构如下:
</p>
<pre>
scheme:[//[user:password@]host[:port]][/]path[?query][#fragment]
</pre>

<p>
其中:
</p>
<dl class="org-dl">
<dt>scheme</dt><dd>描述访问服务器的协议，也就是如何获取该资源，最常见的是http，此外还有ftp等。</dd>
<dt>user:password</dt><dd>这里用于http认证</dd>
<dt>host</dt><dd>那里获取资源</dd>
<dt>port</dt><dd>连接端口号是多少</dd>
<dt>path</dt><dd>具体访问该资源的path</dd>
<dt>query</dt><dd>其他额外参数</dd>
<dt>fragment</dt><dd>片段，为client使用。还有一个params不太常用。</dd>
</dl>

<p>
URL是只支持ascii字符表示的，其他的字符要经过utf-8编码操作。具体转义字符是 <code>%</code> ，比如空格SPACE，具体在URL中的表示就是 <code>%20</code> 。即使是ascii里面，也有一些字符需要转义，然后比如中文字符等，也需要如此utf-8编码和转义。比如 "书"
</p>

<pre>
&gt;&gt;&gt; '书'.encode('utf-8')
b'\xe4\xb9\xa6'
</pre>

<p>
在URL中对应的就是 <code>%e4%b9%a6</code> 。还有其他一些细节，当然实际操作中各个编程语言都提供了良好的函数接口了的，比如python的urlencode函数。
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline2">http header详解</h2>
<div class="outline-text-2" id="text-2">
<p>
本小节主要参考了 <a href="http://kb.cnblogs.com/page/92320/">这个网页</a> ，内容整理得不错，都搬过来了。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline3">名词解释</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt>MIME type</dt><dd>其全称是Multipurpose Internet Mail Extensions ，可以看得出来和email系统有关，但不管怎么说，我们知道其在http里面用于描述文件类型即可。具体就是对应的</dd>
</dl>
<pre>
Content-type : image/jpeg
</pre>
<p>
这一行，image/jpeg 就是MIME type描述，image是主文件类型，jpeg是次文件类型。最常见的是html文件，其MIME type是 <code>text/html</code> 。
</p>

<dl class="org-dl">
<dt>URI</dt><dd>Uniform Resource Identifier ，此外常见的还有URN和URL概念。参考了 <a href="http://stackoverflow.com/questions/4913343/what-is-the-difference-between-uri-url-and-urn">这个网页</a> 。URN和URL都属于URI的范畴，也就是都视同用一连串的字符串来将所有的资源文件分别表示出来，而URN和URL是两种不同的标识方法，URL有点类似于门牌号码街道的描述，其大致有如下结构:</dd>
</dl>

<pre>
scheme:[//[user:password@]host[:port]][/]path[?query][#fragment]
</pre>

<p>
而URN比如:
</p>
<pre>
urn:isbn:0451450523
</pre>

<p>
目前几乎绝大部分URI就是URL，URN只在某些特别领域使用。
</p>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline4">参考资料</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>http权威指南</li>
</ol>
</div>
</div>
</div>
</body>
</html>
